LoadTest/report/statistics.json
{
  "SearchEmpty-1" : {
    "transaction" : "SearchEmpty-1",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 57.2,
    "medianResTime" : 61.0,
    "minResTime" : 37.0,
    "maxResTime" : 80.0,
    "pct1ResTime" : 80.0,
    "pct2ResTime" : 80.0,
    "pct3ResTime" : 80.0,
    "throughput" : 5.868544600938967,
    "receivedKBytesPerSec" : 1378.9761682071596,
    "sentKBytesPerSec" : 0.8023400821596244
  },
  "SearchEmpty-0" : {
    "transaction" : "SearchEmpty-0",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 35.6,
    "medianResTime" : 30.0,
    "minResTime" : 25.0,
    "maxResTime" : 59.0,
    "pct1ResTime" : 59.0,
    "pct2ResTime" : 59.0,
    "pct3ResTime" : 59.0,
    "throughput" : 5.9171597633136095,
    "receivedKBytesPerSec" : 6.824380547337278,
    "sentKBytesPerSec" : 0.6067400147928994
  },
  "SearchShoeModelAndNo" : {
    "transaction" : "SearchShoeModelAndNo",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 489.8,
    "medianResTime" : 489.0,
    "minResTime" : 391.0,
    "maxResTime" : 596.0,
    "pct1ResTime" : 596.0,
    "pct2ResTime" : 596.0,
    "pct3ResTime" : 596.0,
    "throughput" : 3.663003663003663,
    "receivedKBytesPerSec" : 2141.714600503663,
    "sentKBytesPerSec" : 0.5401499542124543
  },
  "SearchInvalidEndpoint" : {
    "transaction" : "SearchInvalidEndpoint",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 36.0,
    "medianResTime" : 35.0,
    "minResTime" : 28.0,
    "maxResTime" : 45.0,
    "pct1ResTime" : 45.0,
    "pct2ResTime" : 45.0,
    "pct3ResTime" : 45.0,
    "throughput" : 5.89622641509434,
    "receivedKBytesPerSec" : 654.686118071934,
    "sentKBytesPerSec" : 0.6564158313679246
  },
  "SearchNonExisting" : {
    "transaction" : "SearchNonExisting",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 173.6,
    "medianResTime" : 179.0,
    "minResTime" : 141.0,
    "maxResTime" : 204.0,
    "pct1ResTime" : 204.0,
    "pct2ResTime" : 204.0,
    "pct3ResTime" : 204.0,
    "throughput" : 5.370569280343717,
    "receivedKBytesPerSec" : 871.4021381578947,
    "sentKBytesPerSec" : 0.7185234291084854
  },
  "SearchEmpty" : {
    "transaction" : "SearchEmpty",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 92.8,
    "medianResTime" : 100.0,
    "minResTime" : 67.0,
    "maxResTime" : 121.0,
    "pct1ResTime" : 121.0,
    "pct2ResTime" : 121.0,
    "pct3ResTime" : 121.0,
    "throughput" : 5.611672278338944,
    "receivedKBytesPerSec" : 1325.0889976150393,
    "sentKBytesPerSec" : 1.3426364337822672
  },
  "SearchWithoutHeaders" : {
    "transaction" : "SearchWithoutHeaders",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 12.8,
    "medianResTime" : 12.0,
    "minResTime" : 11.0,
    "maxResTime" : 16.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 16.0,
    "pct3ResTime" : 16.0,
    "throughput" : 6.157635467980296,
    "receivedKBytesPerSec" : 31.22714939963054,
    "sentKBytesPerSec" : 0.7817310652709359
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 60,
    "errorCount" : 20,
    "errorPct" : 33.333332,
    "meanResTime" : 197.63333333333335,
    "medianResTime" : 69.0,
    "minResTime" : 11.0,
    "maxResTime" : 710.0,
    "pct1ResTime" : 634.9,
    "pct2ResTime" : 695.85,
    "pct3ResTime" : 710.0,
    "throughput" : 18.81467544684854,
    "receivedKBytesPerSec" : 5079.04521646676,
    "sentKBytesPerSec" : 2.6259088860144244
  },
  "SearchWithInvalidRequestType" : {
    "transaction" : "SearchWithInvalidRequestType",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 49.2,
    "medianResTime" : 48.0,
    "minResTime" : 43.0,
    "maxResTime" : 60.0,
    "pct1ResTime" : 60.0,
    "pct2ResTime" : 60.0,
    "pct3ResTime" : 60.0,
    "throughput" : 5.820721769499419,
    "receivedKBytesPerSec" : 645.7761113940629,
    "sentKBytesPerSec" : 1.1254911233993015
  },
  "SearchShoePagination" : {
    "transaction" : "SearchShoePagination",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 677.8,
    "medianResTime" : 696.0,
    "minResTime" : 616.0,
    "maxResTime" : 710.0,
    "pct1ResTime" : 710.0,
    "pct2ResTime" : 710.0,
    "pct3ResTime" : 710.0,
    "throughput" : 3.1806615776081424,
    "receivedKBytesPerSec" : 1885.986328125,
    "sentKBytesPerSec" : 0.382052123091603
  },
  "SearchShoePositive" : {
    "transaction" : "SearchShoePositive",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 128.8,
    "medianResTime" : 109.0,
    "minResTime" : 102.0,
    "maxResTime" : 194.0,
    "pct1ResTime" : 194.0,
    "pct2ResTime" : 194.0,
    "pct3ResTime" : 194.0,
    "throughput" : 5.020080321285141,
    "receivedKBytesPerSec" : 3109.7181695532126,
    "sentKBytesPerSec" : 0.5539737073293173
  },
  "SearchShoeSortByPrice" : {
    "transaction" : "SearchShoeSortByPrice",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 577.0,
    "medianResTime" : 577.0,
    "minResTime" : 469.0,
    "maxResTime" : 693.0,
    "pct1ResTime" : 693.0,
    "pct2ResTime" : 693.0,
    "pct3ResTime" : 693.0,
    "throughput" : 3.1867431485022304,
    "receivedKBytesPerSec" : 1846.6205584767367,
    "sentKBytesPerSec" : 0.4107911089866157
  },
  "SearchWithSpecialCharacters" : {
    "transaction" : "SearchWithSpecialCharacters",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 41.0,
    "medianResTime" : 38.0,
    "minResTime" : 23.0,
    "maxResTime" : 58.0,
    "pct1ResTime" : 58.0,
    "pct2ResTime" : 58.0,
    "pct3ResTime" : 58.0,
    "throughput" : 5.973715651135007,
    "receivedKBytesPerSec" : 7.647989471326166,
    "sentKBytesPerSec" : 0.7408807497013142
  }
}